<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
	<meta http-equiv="content-type" content="text/html; charset=windows-1252"/>
	<title></title>
	<meta name="generator" content="LibreOffice 5.1.5.2 (Windows)"/>
	<meta name="created" content="2016-08-06T11:08:50.459275638"/>
	<meta name="changed" content="2016-08-06T11:16:50.681061003"/>
	<style type="text/css">
		@page { margin: 2cm }
		p { margin-bottom: 0.25cm; line-height: 120% }
		h1 { margin-bottom: 0.21cm }
		h1.western { font-family: "Liberation Sans", sans-serif; font-size: 14pt; font-weight: normal }
		h1.cjk { font-family: "DejaVu Sans"; font-size: 14pt; font-weight: normal }
		h1.ctl { font-family: "FreeSans"; font-size: 14pt; font-weight: normal }
	</style>
</head>
<body lang="de-DE" dir="ltr">
<p align="center" style="margin-top: 0.42cm; margin-bottom: 0.21cm; line-height: 100%; page-break-after: avoid">
<font face="Liberation Sans, sans-serif"><font size="4" style="font-size: 14pt">Projekt
Daisy</font></font></p>
<p align="center" style="margin-top: 0.42cm; margin-bottom: 0.21cm; line-height: 100%; page-break-after: avoid">
<font face="Liberation Sans, sans-serif"><font size="4" style="font-size: 14pt">Lastenheft</font></font></p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<h1 class="western">Vorwort</h1>
<p style="margin-bottom: 0cm; line-height: 100%">Bei diesem Projekt
geht es darum mehr Funkamateuren als bisher einen echten HF Zugang
zum HAM NET zu erm&ouml;glichen. Bisher ist der HF Zugang nur
denjenigen m&ouml;glich, die einen ungest&ouml;rten Blick auf einen
der Gigaherz Links haben und die zus&auml;tzlich auch noch eine
Au&szlig;enantenne montieren k&ouml;nnen.</p>
<p style="margin-bottom: 0cm; line-height: 100%">In einer Stadt wie
Berlin sind damit die allermeisten Funkamateure ausgeschlossen. Es
besteht zwar die M&ouml;glichkeit &uuml;ber das Internet einen IP
unnel zu einer Zugangsstation herzustellen, doch damit geht die
eigentliche Idee, ein eigenes HF gest&uuml;tztes Netz f&uuml;r uns
Funkamateure zu haben, verloren.</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%">Um mehr
Funkamateuren einen echten HF Zugang zu erm&ouml;glichen ist es daher
notwendig eine Funktechnik zu verwenden, die auch im Stadtgebiet ohne
direkte Sicht auf die Zugangsstation und auch mit Innenantennen noch
eine Chance auf Verbindung erm&ouml;glicht. Aufgrund der
physikalischen Eigenschaften der elektromagnetischen
Wellenausbreitung scheiden damit alle Breitbandzug&auml;nge oberhalb
von etwa 1 GHz von vornherein aus.</p>
<p style="margin-bottom: 0cm; line-height: 100%">Doch neben den
Gegebenheiten der Wellenausbreitung besteht beim HAM NET noch die
Notwendigkeit einen Datendurchsatz zu erzielen, der zumindest
ann&auml;hernd an die Gr&ouml;&szlig;enordnung einer normalen DSL
Anbindung heranreicht. Dies ist notwendig um Timeouts in der
Linkschicht des haupts&auml;chlich verwendeten TCP Protokolles
zuvermeiden.</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%">Damit scheiden alle
digitalen &Uuml;bertragungsverfahren, die einen normalen NF Kanal mit
bis zu 25 kHz Bandbreite benutzen, von vornherein aus. F&uuml;r eine
solche Zugangstechnik k&ouml;nnen daher keine normalen Funkger&auml;te
mehr verwendet werden, sondern es m&uuml;ssen spezielle
Linktransceiver eingesetzt werden. Ebenso scheidet damit das 2m Band
sowie alle darunter liegenden B&auml;nder aufgrund des Bandplanes
aus.</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%">&Uuml;brig bleibt
das 70cm Band, das sowohl breitbandige Zuweisungen f&uuml;r die
digitale &Uuml;bertragung hat als auch noch vertretbare
&Uuml;bertragungseigenschaften.</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<h1 class="western">Warum gibt es das noch nicht?</h1>
<p style="margin-bottom: 0cm; line-height: 100%">Es gab bereits
einige Versuche an Universit&auml;ten und in &Ouml;sterreich solche
Linktransceiver zu entwickeln. Alle diese Projekte sind meines
Erachtens daran gescheitert, dass vor allem im universit&auml;ren
Bereich die Anspr&uuml;che an die Fortschrittlichkeit und
Neuartigkeit  eines solchen Linktransceivers viel zu hoch und damit
f&uuml;r den normalen Funkamateur nicht umsetzbar waren. Was
verst&auml;ndlich f&uuml;r das erforderliche Niveau einer
Doktorarbeit ist, verhindert hier eine einfache Nachbauf&auml;higkeit
f&uuml;r den normalen Funkamateur. Der &ouml;sterreichische Ansatz
Chips aus dem Handyumfeld f&uuml;r diesen Zweck zu benutzen
scheiterte schon daran, dass durch die im Vergleich zum Handynetz
viel l&auml;ngeren Linkstrecken ein gen&uuml;gend exaktes Timing f&uuml;r
das eingesetzte Time 
</p>
<p style="margin-bottom: 0cm; line-height: 100%">Division
Multiplexing nicht mehr zu realisieren sind.</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%">Beim Handynetz
stehen die Relaisstationen gen&uuml;gend dicht beeinander, dass die
Signallaufzeit vom Linktransceiver zur Relaisstation nur eine
geringen Zeitabstand von Zeitslot zu Zeitslot erm&ouml;glicht. Bei
den erheblich l&auml;ngeren Laufzeiten, die wir f&uuml;r unsere
Relaisstationen br&auml;uchten, m&uuml;ssten die Zeitabst&auml;nde
zwischen den Zeitslots so gro&szlig; gemacht werden, dass der
Durchsatz v&ouml;llig zusammenbrechen w&uuml;rde. Dieses Problem wird
auch noch dadurch versch&auml;rft, dass vor jedem Frame eine l&auml;ngere
Sequenz von Bits gesendet werden muss um dem Empf&auml;nger die
M&ouml;glichkeit zu geben sich zu synchronisieren.</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<h1 class="western">Die Idee</h1>
<p style="margin-bottom: 0cm; line-height: 100%">Wir brauchen einen
Linktransceiver, der auf vorhandenen Techniken und Chips aufsetzt,
die preiswert genug sind um in gr&ouml;&szlig;erer St&uuml;ckzahl
hergestellt werden k&ouml;nnen und die einfach genug zu realisieren
sind, damit sie von einem Funkamateur noch nachgebaut werden zu
k&ouml;nnen. Solche Bausteine gibt es inzwischen aus der ISM Technik,
also der Technik zur &Uuml;bertragung von Informationen im Industrie
und Heim Sektor. Neben dem 900 MHz Bereich sind f&uuml;r diese
Bausteine Frequenzen um 433 MHz herum zugewiesen. Bei einigen dieser
Bausteine l&auml;sst sich die Frequenz auch auf andere Frequenzen im
70cm Band programmieren.</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%">Anders als die Handy
Chips arbeiten diese ISM Chips entweder blind, also sie senden ohne
vorher auf der Frequenz zu h&ouml;ren, oder sie verwenden das CSMA
(Carrier Select Multiple Access) Verfahren, das wir Funkamateure auch
schon bei Packet Radio erfolgreich einsetzen. Letztere sind auch f&uuml;r
unsere Zwecke geeignet.</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%">Nach einigen
Recherchen habe ich einen Baustein gefunden, der, so wie ich glaube,
besonders gut f&uuml;r unsere Zwecke geeignet ist, das RFM22B Link
Transceiver Modul von HOPE Microelectronics.</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%">Die Spezifikation
befindet sich in der Datei RFM22B.pdf im Ordner doc/3rdparty.</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%">73, 55, DF9RY -
Tania</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
<p style="margin-bottom: 0cm; line-height: 100%"><br/>

</p>
</body>
</html>